function kvadratnoe(){
    
    //коефіцієнти   a ,   b   і   c
    var a;
    var b;
    var c;
    var D;
    var x1, x2;
    
    
    //початкове значення А, воно не повинно = 0
    a = prompt("Введите число 'a'", "");
    
    //Перевірка на 0
    if(a == 0){
        alert('Коефіцієнтт а не повинен дорівнювати 0! Введіть інше число.');
        //перезаписуєм значення змінної "а"
        a = prompt("Введіть число 'a'", "");
    }

    b = prompt("Введіть число 'b'", "");
    c = prompt("Введіть число 'c'", "");
    

    //Розраховуємо дискримінант  D = b*b– 4ac  
    //Math.pow  піднесення до степеня.  Перше число прийняли з форми, друге в яку степінь підносимо
    
    D = Math.pow(b,2) - 4*a*c;
    
    document.write("дискримінант дорівнює " + D + "<br>");
    
    //Перевірка на наявність коренів якщо   D < 0 ,   то квадратне рівняння не має коренів ;  
    if(D < 0){
        //Записуємо на екран 
         document.write("Рівняння не має коренів");
         //вихід із функції
         return D;
         
    }else if(D == 0){
        
        //якщо дискримінант == 0,то один тілько корінь
        document.write("якщо D = 0, то квадратне рівняння має один корінь ");
        //розрахунок x1
        x1 = -b/(2*a);
        //Записуємо на екран x1
        document.write("Значення кореня x1" + x1);
        return x1;
        
    }else{
        //Тільки один вариант коли D > 0 , розраховуємо два кореня x1,x2;
        
        //розрахунок x1 / Math.sqrt квадратный корінь із дискримінанта
        x1 = (-b + Math.sqrt(D))/(2*a);
        
        //розрахунок x2
        x2 = (-b - Math.sqrt(D))/(2*a);
        
        document.write("Значення корня x1 = " + x1 + "<br>");
        document.write("Значення корня x2 = " + x2 + "<br>");
    }
}